Revit 2026 API

# SpaceDesignReturnAirflow Property

---

Get or set the Specified Return Airflow of the Space.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double DesignReturnAirflow { get; set; }
```
```vb
Public Property DesignReturnAirflow As Double
	Get
	Set
```
```cpp
public:
property double DesignReturnAirflow {
	double get ();
	void set (double value);
}
```
```fsharp
member DesignReturnAirflow : float with get, set
```

#### Property Value

Double

This property is used to get or set the Specified Return Airflow (Unit: CFM) of the Space.

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace